try mermaid diagram
